package com.worldsay.pojo;

/**
 * Created by LXG on 2015/8/29.
 */
public class MessageDetails {

    /**
     * author : 李良勇
     * content : 新华网北京8月27日电 据新华社“新华国际”客户端报道，美国两名记者26日晨在弗吉尼亚州直播电视节目过程中遭枪击身亡。枪手身份暂不清楚，行凶动因不明确。

     事发早晨6时45分，地点位于贝德福德县莫尼塔附近的布里奇沃特广场一处购物中心。当时，供职于哥伦比亚广播公司下属的WDBJ电视台的摄像师亚当·沃德和记者艾莉森·帕克正在做专题报道。

     新华国际客户端报道，在沃德倒地前拍摄的画面中，可以听到枪声，帕克和采访对象在尖叫。画面显示，帕克和一名女性采访对象正在一处阳台上谈及旅游业发展，枪手似乎从后面靠近。
     （图1）
     位于罗阿诺克市的这家电视台主管杰弗里·马克斯证实，沃德和帕克遇害。按照他的说法，沃德和帕克是被近距离射杀，枪手据信开了六七枪。

     “我们不知道动机，我们不知道谁是嫌疑人或谁是凶手，”马克斯说，“这是针对两名好记者的可怕罪行。”

     摄像机掉在地上后，拍摄到枪手的模糊影像，显示枪手穿着黑色裤子、蓝色上衣，拿着一支手枪。

     据当地媒体报道，枪手可能是这家电视台一名心怀不满的前雇员。
     （图2）

     美国有线电视新闻网报道，帕克24岁，弗吉尼亚当地人，毕业于弗吉尼亚州哈里森堡的詹姆斯·麦迪逊大学媒体艺术与设计学院。她在电视台网站的简历显示，她以实习生身份加入电视台，是早间新闻记者。

     在个人“脸书”主页上，帕克说她喜欢交际舞、戏剧和皮划艇运动。主页信息显示，她一周前刚过完生日。

     沃德24岁，毕业于弗吉尼亚理工大学。

     马克斯说，沃德和帕克都“已经跟电视台里的其他员工订了婚”。

     电视台主播克里斯·赫斯特在网上留言说，他和帕克“非常相爱……（听到消息）我都傻了”。

     “她（帕克）每天都和沃德一起工作。他们是个团队。我为他（沃德）的未婚妻感到心碎。”

     弗吉尼亚州州长特里·麦考利夫在微博客网站“推特”上说，他对这起“冷血谋杀感到难过”。他说，州警方正与地方当局一同，搜捕枪手。
     */

    private String author;
    private String content;

    public void setAuthor(String author) {
        this.author = author;
    }

    public void setContent(String content) {
        this.content = content;
    }

    public String getAuthor() {
        return author;
    }

    public String getContent() {
        return content;
    }
}
